

#include "util_z80.h"
#include "util_sd.h"
#include "ff.h"
#include <fcntl.h>
#include <string.h>
#include "zx_emu/Z80.h"
#include "aySoft.h"
#include "zx_emu/zx_machine.h"
#include "screen_util.h"

extern Z80 cpu;

extern uint8_t* zx_cpu_ram[4];//Адреса 4х областей памяти CPU при использовании страниц
extern uint8_t* zx_ram_bank[8];
extern uint8_t* zx_rom_bank[4];//Адреса 4х областей ПЗУ (48к 128к TRDOS и резерв для какого либо режима(типа тест))
extern uint8_t* zx_video_ram;

extern bool zx_state_48k_MODE_BLOCK;
extern uint8_t zx_Border_color;

extern void zx_machine_set_7ffd_out(uint8_t val);
extern uint8_t zx_machine_get_7ffd_lastOut();
extern uint32_t zx_RAM_bank_active;
//extern char sd_buffer[SD_BUFFER_SIZE];
extern int last_error;

typedef struct FileHeader{
	uint8_t A; //0  A register
	uint8_t F; //1  F register
	uint8_t C; //2  BC register pair (LSB, i.e. C, first)
	uint8_t B; //3  BC register pair (LSB, i.e. C, first)
	uint8_t L; //4  HL register pair
	uint8_t H; //5  HL register pair
	uint16_t PC; //7<<6 PC (version 1) or 0 to signal a version 2 or 3
	uint16_t SP; //9<<8 Stack pointer
	uint8_t IR;  //10
	uint8_t RR;  //11
	uint8_t Flags1; //12
	uint8_t E; //13
	uint8_t D; //14
	uint8_t C_Dash; //15
	uint8_t B_Dash; //16
	uint8_t E_Dash; //17
	uint8_t D_Dash; //18
	uint8_t L_Dash; //19
	uint8_t H_Dash; //20
	uint8_t A_Dash; //21
	uint8_t F_Dash; //22
	uint16_t IY; //24<<23
	uint16_t IX; //26<<25
	uint8_t InterruptFlipFlop; //27
	uint8_t IFF2; //28
	uint8_t Flags2; //29
	uint16_t AdditionalBlockLength; //31<<30
	uint16_t PCVersion2; //32<<33
	uint8_t HardwareMode; //34
	uint8_t PagingState; //35
	uint8_t IF1RomPaged; //36
	uint8_t HWModeState; //37
	uint8_t LastOut_FFFD; //38
	uint8_t AY_Regs[16]; //39-55
} __attribute__((packed)) FileHeader;

typedef struct MemBlock{
	uint16_t Size; //1<<0
	uint8_t PageNum;//2
} __attribute__((packed)) MemBlock;


int fd;                     //индикатор ошибки чтения файла
char buf[10];               //временный буфер
char header_buf[87];        // буфер для чтения заголовка

void readAYState(FileHeader* header){
	for (uint8_t i=0;i<16;i++){
		AY_select_reg(i);
		AY_set_reg(header->AY_Regs[i]);
		//printf("GET AY[%02d]=%02X\n",i,header->AY_Regs[i]);
		// cpu._hi_addr_port = 0xFF;
		// cpu.port_out(&cpu,0xFD,i);
		// cpu._hi_addr_port = 0xBF;        
		// cpu.port_out(&cpu,0xFD,header[i+39]);
	}
	AY_select_reg(header->LastOut_FFFD);
}

void saveAYState(FileHeader* header){
	header->LastOut_FFFD = zx_machine_get_7ffd_lastOut();
	for (uint8_t i=0;i<16;i++){
		AY_select_reg(i);
		header->AY_Regs[i] = AY_get_reg();
